Open Foam files/Pipe/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    Walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          10655;
        startFace       137852;
    }
    outlet
    {
        type            patch;
        inGroups        List<word> 1(outlet);
        nFaces          202;
        startFace       148507;
    }
    inlet1
    {
        type            patch;
        inGroups        List<word> 1(inlet);
        nFaces          202;
        startFace       148709;
    }
    inlet2
    {
        type            patch;
        inGroups        List<word> 1(inlet);
        nFaces          52;
        startFace       148911;
    }
)

// ************************************************************************* //
