Open Foam files/Pipe/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
48763
(
(-0.099418114 0.00059588266 1.5322101e-06)
(-0.099813074 -2.1338053e-05 6.3388877e-05)
(-0.099637543 -1.2648763e-05 1.5904916e-05)
(-0.099630123 2.9947395e-05 1.128418e-05)
(-0.099616577 2.1968511e-05 5.0761977e-06)
(-0.099620296 7.4171516e-06 9.3692468e-07)
(-0.099623343 3.9547773e-06 3.3917921e-07)
(-0.099624577 2.5319185e-06 4.5898958e-08)
...
)
;

boundaryField
{
    Walls
    {
        type            noSlip;
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           nonuniform List<vector> 
202
(
(-0.050098853 0.12331045 -0.05075955)
(0 0.057112845 0)
(-0.010570321 0.1419273 0.015150423)
(0.0046926935 0.1695759 0.04661666)
(-0.0038628463 0.16959457 0.046262676)
(0.010074037 0.14052453 0.011236014)
(0.056951138 0.11841365 -0.058690026)
(-0.15882602 0.08633012 -0.078612479)
...
)
;
    }
    inlet1
    {
        type            pressureInletOutletVelocity;
        value           nonuniform List<vector> 
202
(
(-0.099418114 0.00059588266 1.5322101e-06)
(-0.099578877 -5.3083443e-06 7.9475855e-06)
(-0.099621092 -1.7561717e-06 -1.0489824e-05)
(-0.099580041 1.1313904e-05 7.6867554e-05)
(-0.099142939 -0.00055817336 0.00071543655)
(-0.099593726 -1.2448664e-05 2.4058365e-06)
(-0.099630337 -4.0021723e-07 2.1639e-06)
(-0.099577603 2.6272189e-05 5.8542106e-06)
...
)
;
    }
    inlet2
    {
        type            fixedValue;
        value           uniform (0 1 0);
    }
}


// ************************************************************************* //
