Open Foam files/Pipe/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
137852
(
-1.4806156e-06
-0.00032117402
-1.9729754e-06
-3.3983992e-05
2.9596824e-08
0.00034417637
-0.00034438699
-1.0998034e-07
...
)
;

boundaryField
{
    Walls
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
202
(
0.00053159305
-0.00027705898
0.00057097795
0.00071893789
0.00071803285
0.00055492529
0.00048373032
2.0305364e-05
...
)
;
    }
    inlet1
    {
        type            calculated;
        value           nonuniform List<scalar> 
202
(
0.00035861149
0.00042395258
0.00039859801
0.00045370708
0.00035847691
0.00040443299
0.00039131328
0.00041309772
...
)
;
    }
    inlet2
    {
        type            calculated;
        value           nonuniform List<scalar> 
52
(
-0.003405506
-0.0032766681
-0.0043974835
-0.0028084204
-0.0016918576
-0.0040134947
-0.0045748642
-0.0039329862
...
)
;
    }
}


// ************************************************************************* //
